{
  "path": "origin-arc/index.mdx",
  "content": "I’m a 2025 Computer Science and Engineering graduate — though if you had asked me a few years back, I’d have told you engineering was the last thing I wanted to pursue. I had my eyes on humanities, design, maybe even fashion or product design, but life had its own plans. Somewhere along the way, despite resisting it at first, I stepped into tech. Looking back now, I think it was one of the best decisions I’ve made.\n\nI’ve always believed in manifestation and in the idea that what you focus on eventually shapes your reality. For a long time, I told myself that engineering wasn’t for me, yet here I am, finding joy in building, solving, and experimenting. To me, there’s a kind of magic in turning zeros and ones into something tangible — something that people can see, use, and benefit from.\n\nMy journey began with a strong love for mathematics — the kind that kept me solving tough problems even outside the syllabus. At the same time, I’ve carried a creative streak with me for over a decade as a self-taught portrait artist. That blend of analytical precision and artistic expression is something I bring into the way I build products: functional, yet crafted with care.\n\nOver the past few years, I’ve had the chance to work with multiple startups and open-source projects, taking on everything from backend systems and complex frontends to AI workflows and even early AR/VR prototypes. Each experience taught me how to adapt, take ownership, and build things from scratch that are not only technically sound but also user-focused. Somewhere along the way, I realized that my true passion lies in solving niche, user-centric problems and creating experiences that feel like they were made just for the people using them.\n\nLooking ahead, I’m deeply interested in how AI, AR, and VR can evolve into a cognitive layer that enhances human potential rather than just automating tasks. In the next five to seven years, my goal is to launch my own product and build a personal brand that reflects this vision.\n\nOutside of work, I’m a mountain person at heart who loves traveling and finding calm in high altitudes. I enjoy bike rides — sometimes solo, sometimes in groups — and I find cooking therapeutic. My specialty? Gajar ka halwa, made with my mom’s recipe.\n\nAt the core of it all, I try to stay humble, grounded, and curious. Whether it’s through code, art, or even food, I see creation as a way of connecting with people and leaving something meaningful behind."
}