{
  "path": "origin-arc/index.mdx",
  "content": "I never imagined myself in engineering. For the longest time, I leaned toward humanities, design, maybe even fashion or product design. But life had its own plans, and somewhere along the way, I found myself stepping into tech. What began as resistance has turned into one of the best decisions of my life.\n\nI’ve always believed in manifestation — that what you focus on eventually shapes your reality. For years, I kept telling myself that engineering wasn’t for me. Yet here I am, discovering joy in building, solving, and experimenting. There’s a kind of magic in turning zeros and ones into something real — something people can see, use, and benefit from.\n\nOver the past few years, I’ve worked with multiple startups and open-source projects, contributing across the stack: backend systems, complex frontends, AI workflows, and even early AR/VR prototypes. Each experience has sharpened my ability to adapt, take ownership, and build from scratch — not just technically sound systems, but products shaped with the end user in mind.\n\nAlongside this, I’ve carried a love for mathematics and a creative streak as a self-taught portrait artist. That blend of analytical precision and artistic expression shapes how I approach product-building: functional, yet crafted with care.\n\nI’m especially drawn to the ways emerging technologies like AI, AR, and VR can create more intuitive, human-centered experiences. For me, it’s not just about efficiency — it’s about building tools and systems that feel natural, immersive, and empowering for the people who use them.\n\nOutside of work, I’m a mountain person at heart who finds calm in high altitudes. I enjoy bike rides — sometimes solo, sometimes in groups — and I find cooking therapeutic. My specialty? Gajar ka halwa, made with my mom’s recipe.\n\nAt the core of it all, I try to stay humble, grounded, and curious. Whether through code, art, or even food, I see creation as a way of connecting with people and leaving something meaningful behind."
}