{
  "path": "origin-arc/index.mdx",
  "content": "I’m a 2025 Computer Science and Engineering graduate — though if you’d asked me a few years ago, I’d have told you tech was *the last thing I wanted to pursue*. I imagined myself in design or even fashion, creating something artistic and human-centered. But life has its way of guiding us, and somewhere along the way, I found myself in engineering. Today, I see it as one of the best decisions I’ve ever made.\n\nI’ve always believed in manifestation — that what you focus on shapes what you become. Initially, I resisted tech, but once I started building, solving, and experimenting, I realized it gave me the same joy as creating art. Turning “zeros and ones” into something people can actually use feels almost magical.\n\n**My Journey So Far**\n\nI started my academic journey with a strong love for Maths — the kind that had me solving extra books just for fun. Alongside that analytical side, I’ve also been a self-taught portrait artist for over a decade, blending creativity with discipline. That balance of logic and art has shaped how I approach building products today.\n\nOver the years, I’ve worked across multiple startups — wearing many hats and thriving in fast-paced environments:\n\n* **Backend ownership**: built authentication & notification layers from scratch.\n* **Frontend expertise**: led UI development, optimized workflows, introduced caching, and implemented complex e-commerce UX.\n* **Open source**: contributed through **Google Summer of Code 2024** at Palisados Foundation, where I migrated their object storage to self-hosted MinIO.\n* **AI systems**: designed workflows, orchestrations, validations, and companion+LMS products.\n* **AR/VR exploration**: created MVPs back in 2021 with Blender for jewelry, clothing, and accessories — long before it was hype.\n* Currently, I’m working full-time as a software engineer, continuing to build scalable, user-focused systems.\n\n**What Drives Me**\n\nI didn’t step into tech out of passion at first — passion found me as I built things. Today, what excites me is:\n\n* Crafting solutions for niche, **user-centric problems**.\n* Designing products that feel like they were built *for the user*.\n* The thrill of turning abstract ideas into something tangible that impacts people’s lives.\n* Choosing problems that resonate with me personally, ensuring authenticity in what I create.\n\n**Looking Ahead**\n\nMy vision is to build something at the intersection of **AI, AR, and VR** that contributes to a new **cognitive layer** of technology — systems that don’t just automate tasks but enhance human potential. In the next 5–7 years, I aim to launch my own product and build a personal brand around it.\n\nAt the heart of it all, I try to stay humble, grounded, and open to learning. Whether it’s solving a technical challenge, sketching a portrait, or shaping the future of AI, I’m driven by the belief that creation should be meaningful, empathetic, and lasting."
}