[
  {
    "title": "1984",
    "author": "George Orwell",
    "image": "https://books.google.com/books/content?id=kotPYEqx7kMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "completed",
    "start_date": "2025-09-08",
    "end_date": "2025-09-08",
    "issue_number": 8,
    "google_books_id": "kotPYEqx7kMC",
    "isbn": "9780547249643",
    "published_date": "2013-09-03",
    "description": "75th ANNIVERSARY EDITION “Orwell saw, to his credit, that the act of falsifying reality is only secondarily a way of changing perceptions. It is, above all, a way of asserting power.”—The New Yorker In 1984, London is a grim city in the totalitarian state of Oceania where Big Brother is always watching you and the Thought Police can practically read your mind. Winston Smith is a man in grave danger for the simple reason that his memory still functions. Drawn into a forbidden love affair, Winston finds the courage to join a secret revolutionary organization called The Brotherhood, dedicated to the destruction of the Party. Together with his beloved Julia, he hazards his life in a deadly match against the powers that be. Lionel Trilling said of Orwell’s masterpiece, “1984 is a profound, terrifying, and wholly fascinating book. It is a fantasy of the political future, and like any such fantasy, serves its author as a magnifying device for an examination of the present.” Though the year 1984 now exists in the past, Orwell’s novel remains an urgent call for the individual willing to speak truth to power.",
    "page_count": 309
  },
  {
    "title": "And Then There Were None",
    "author": "AGATHA CHRISTIE",
    "image": "https://books.google.com/books/content?id=gAD4EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 9,
    "google_books_id": "gAD4EAAAQBAJ",
    "isbn": "",
    "published_date": "2024-02-29",
    "description": "First, there were ten—a curious assortment of strangers summoned as weekend guests to a little private island off the coast of Devon. Their host, an eccentric millionaire unknown to all of them, is nowhere to be found. All that the guests have in common is a wicked past they're unwilling to reveal—and a secret that will seal their fate. For each has been marked for murder. A famous nursery rhyme is framed and hung in every room of the mansion: \"Ten little boys went out to dine; One choked his little self and then there were nine. Nine little boys sat up very late; One overslept himself and then there were eight. Eight little boys traveling in Devon; One said he'd stay there then there were seven. Seven little boys chopping up sticks; One chopped himself in half and then there were six. Six little boys playing with a hive; A bumblebee stung one and then there were five. Five little boys going in for law; One got in Chancery and then there were four. Four little boys going out to sea; A red herring swallowed one and then there were three. Three little boys walking in the zoo; A big bear hugged one and then there were two. Two little boys sitting in the sun; One got frizzled up and then there was one. One little boy left all alone; He went out and hanged himself and then there were none.\" When they realize that murders are occurring as described in the rhyme, terror mounts. One by one they fall prey. Before the weekend is out, there will be none. Who has choreographed this dastardly scheme? And who will be left to tell the tale? Only the dead are above suspicion.",
    "page_count": 204
  },
  {
    "title": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://books.google.com/books/content?id=FzVjBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 10,
    "google_books_id": "FzVjBgAAQBAJ",
    "isbn": "9780062416216",
    "published_date": "2015-02-24",
    "description": "AN INTERNATIONAL BESTSELLER • OVER 80 MILLION COPIES SOLD WORLDWIDE “Translated into 80 languages, the allegory teaches us about dreams, destiny, and the reason we are all here.”—Oprah Daily, “Best Self-Help Books of a Generation” “It’s a brilliant, magical, life-changing book that continues to blow my mind with its lessons. [...] A remarkable tome.”—Neil Patrick Harris, actor A special 25th anniversary edition of the extraordinary international bestseller, including a new foreword by Paulo Coelho. Combining magic, mysticism, wisdom, and wonder into an inspiring tale of self-discovery, The Alchemist has become a modern classic, selling millions of copies around the world and transforming the lives of countless readers across generations. Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams. “A magical little volume.”—San Francisco Chronicle “[This] Brazilian wizard makes books disappear from stores.”—The New York Times “A sweetly exotic tale for young and old alike.”—Publishers Weekly",
    "page_count": 166
  },
  {
    "title": "The Pilgrimage",
    "author": "Paulo Coelho",
    "image": "https://books.google.com/books/content?id=atdJcAL3MBQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 11,
    "google_books_id": "atdJcAL3MBQC",
    "isbn": "9780062512796",
    "published_date": "1995-05",
    "description": "This gorgeously repackaged international bestseller recounts the spectacular trials of Paulo Coelho and his mysterious mentor, Petrus, as they make their journey of discovery across Spain--on a legendary road that has been traveled by pilgrims since the Middle Ages.",
    "page_count": 276
  },
  {
    "title": "The Diary of Anne Frank",
    "author": "Anne Frank",
    "image": "",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 12,
    "google_books_id": "5wJAtQEACAAJ",
    "isbn": "",
    "published_date": "1971",
    "description": "",
    "page_count": 223
  },
  {
    "title": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://books.google.com/books/content?id=s1gVAAAAYAAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 13,
    "google_books_id": "s1gVAAAAYAAJ",
    "isbn": "",
    "published_date": "1918",
    "description": "Austen’s most celebrated novel tells the story of Elizabeth Bennet, a bright, lively young woman with four sisters, and a mother determined to marry them to wealthy men. At a party near the Bennets’ home in the English countryside, Elizabeth meets the wealthy, proud Fitzwilliam Darcy. Elizabeth initially finds Darcy haughty and intolerable, but circumstances continue to unite the pair. Mr. Darcy finds himself captivated by Elizabeth’s wit and candor, while her reservations about his character slowly vanish. The story is as much a social critique as it is a love story, and the prose crackles with Austen’s wry wit.",
    "page_count": 448
  },
  {
    "title": "How to Win Friends and Influence People",
    "author": "Dale Carnegie ",
    "image": "https://books.google.com/books/content?id=aC76EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 14,
    "google_books_id": "aC76EAAAQBAJ",
    "isbn": "9789773772598",
    "published_date": "2024-03-10",
    "description": "How to Win Friends and Influence people is one of the first best selling self-help books ever published. Written by Dale Carnegie and first published in 1936, it has sold more than 15 million copies world-wide. The possible situations are endless: you’re moved to new town and forgotten how to do this “people” thing; your long-term relationship has left your social netweork lacking or maybe you merley lack social skills- whatever it is, we all need friends. what should be as simple as eating and breating seems such an intimidating process, doesn’t it? As with anything, take it one step at a time. Troughout human history, the predominant way we’ve build relationships is through real-time conversation. This throne is about to be taken over if it hasn’t already been.",
    "page_count": 288
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "author": "J. K. Rowling",
    "image": "https://books.google.com/books/content?id=djf_RQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 15,
    "google_books_id": "djf_RQAACAAJ",
    "isbn": "9781408810545",
    "published_date": "2010-01-01",
    "description": "\"Harry Potter thinks he is an ordinary boy. He lives with Uncle Vernon, Aunt Petunia and his cousin, Dudley, who make him sleep in a cupboard under the stairs. Then Harry starts receiving mysterious letters and his life is changed for ever. He is whisked away by a beetle-eyed giant of a man and enrolled in Hogwarts School of Witchcraft and Wizardry. The reason: Harry Potter is a wizard!\"--P. [4] of cover.",
    "page_count": 223
  },
  {
    "title": "Harry Potter and the Chamber of Secrets",
    "author": "J.K. Rowling",
    "image": "https://books.google.com/books/content?id=5iTebBW-w7QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 16,
    "google_books_id": "5iTebBW-w7QC",
    "isbn": "9781781100509",
    "published_date": "2015-12-08",
    "description": "'There is a plot, Harry Potter. A plot to make most terrible things happen at Hogwarts School of Witchcraft and Wizardry this year.' Harry Potter's summer has included the worst birthday ever, doomy warnings from a house-elf called Dobby, and rescue from the Dursleys by his friend Ron Weasley in a magical flying car! Back at Hogwarts School of Witchcraft and Wizardry for his second year, Harry hears strange whispers echo through empty corridors - and then the attacks start. Students are found as though turned to stone... Dobby's sinister predictions seem to be coming true. Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "page_count": 346
  },
  {
    "title": "Harry Potter and the Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "image": "https://books.google.com/books/content?id=Sm5AKLXKxHgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 17,
    "google_books_id": "Sm5AKLXKxHgC",
    "isbn": "9781781100516",
    "published_date": "2015-12-08",
    "description": "'Welcome to the Knight Bus, emergency transport for the stranded witch or wizard. Just stick out your wand hand, step on board and we can take you anywhere you want to go.' When the Knight Bus crashes through the darkness and screeches to a halt in front of him, it's the start of another far from ordinary year at Hogwarts for Harry Potter. Sirius Black, escaped mass-murderer and follower of Lord Voldemort, is on the run - and they say he is coming after Harry. In his first ever Divination class, Professor Trelawney sees an omen of death in Harry's tea leaves... But perhaps most terrifying of all are the Dementors patrolling the school grounds, with their soul-sucking kiss... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "page_count": 451
  },
  {
    "title": "Harry Potter and the Goblet of Fire",
    "author": "J.K. Rowling",
    "image": "https://books.google.com/books/content?id=etukl7GfrxQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 18,
    "google_books_id": "etukl7GfrxQC",
    "isbn": "9781781100523",
    "published_date": "2015-12-08",
    "description": "'There will be three tasks, spaced throughout the school year, and they will test the champions in many different ways ... their magical prowess - their daring - their powers of deduction - and, of course, their ability to cope with danger.' The Triwizard Tournament is to be held at Hogwarts. Only wizards who are over seventeen are allowed to enter - but that doesn't stop Harry dreaming that he will win the competition. Then at Hallowe'en, when the Goblet of Fire makes its selection, Harry is amazed to find his name is one of those that the magical cup picks out. He will face death-defying tasks, dragons and Dark wizards, but with the help of his best friends, Ron and Hermione, he might just make it through - alive! Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "page_count": 757
  },
  {
    "title": "Harry Potter and the Order of the Phoenix",
    "author": "J.K. Rowling",
    "image": "https://books.google.com/books/content?id=zpvysRGsBlwC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 19,
    "google_books_id": "zpvysRGsBlwC",
    "isbn": "9781781100530",
    "published_date": "2015-12-08",
    "description": "'You are sharing the Dark Lord's thoughts and emotions. The Headmaster thinks it inadvisable for this to continue. He wishes me to teach you how to close your mind to the Dark Lord.' Dark times have come to Hogwarts. After the Dementors' attack on his cousin Dudley, Harry Potter knows that Voldemort will stop at nothing to find him. There are many who deny the Dark Lord's return, but Harry is not alone: a secret order gathers at Grimmauld Place to fight against the Dark forces. Harry must allow Professor Snape to teach him how to protect himself from Voldemort's savage assaults on his mind. But they are growing stronger by the day and Harry is running out of time... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "page_count": 992
  },
  {
    "title": "Harry Potter and the Half-Blood Prince",
    "author": "J. K. Rowling",
    "image": "https://books.google.com/books/content?id=KCl-vgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "status": "reading",
    "start_date": "2025-09-09",
    "end_date": null,
    "issue_number": 20,
    "google_books_id": "KCl-vgEACAAJ",
    "isbn": "9781536443776",
    "published_date": "2018-06-26",
    "description": "Harry Potter, now sixteen-years-old, begins his sixth year at school in the midst of the battle between good and evil which has heated up with the return of the Dark Lord Voldemort.",
    "page_count": 652
  },
  {
    "title": "Harry Potter and the Deathly Hallows",
    "author": "J.K. Rowling",
    "image": "https://books.google.com/books/content?id=_oaAHiFOZmgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "completed",
    "start_date": "2025-09-09",
    "end_date": "2025-09-10",
    "issue_number": 21,
    "google_books_id": "_oaAHiFOZmgC",
    "isbn": "9781781102435",
    "published_date": "2015-12-08",
    "description": "'Give me Harry Potter,' said Voldemort's voice, 'and none shall be harmed. Give me Harry Potter, and I shall leave the school untouched. Give me Harry Potter, and you will be rewarded.' As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy... Having become classics of our time, the Harry Potter eBooks never fail to bring comfort and escapism. With their message of hope, belonging and the enduring power of truth and love, the story of the Boy Who Lived continues to delight generations of new readers.",
    "page_count": 771
  },
  {
    "title": "The Merchant of Venice",
    "author": "William Shakespeare",
    "image": "https://books.google.com/books/content?id=5_LGDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "completed",
    "start_date": "2025-09-09",
    "end_date": "2025-09-10",
    "issue_number": 22,
    "google_books_id": "5_LGDAAAQBAJ",
    "isbn": "",
    "published_date": "2021-01-01",
    "description": "The Merchant of Venice is one of Shakespeare’s most popular comedies, but it remains deeply controversial. The text may seem anti-Semitic; yet repeatedly, in performance, it has revealed a contrasting nature. Shylock, though vanquished in the law-court, often triumphs in the theatre. In his intensity he can dominate the play, challenging abrasively its romantic and lyrical affirmations. What results is a bitter-sweet drama. Though The Merchant of Venice offers some of the traditional pleasures of romantic comedy, it also exposes the operations of prejudice. Thus Shakespeare remains our contemporary",
    "page_count": 88
  },
  {
    "title": "The Tempest",
    "author": "William Shakespeare",
    "image": "https://books.google.com/books/content?id=HcUsDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "status": "completed",
    "start_date": "2025-09-09",
    "end_date": "2025-09-10",
    "issue_number": 23,
    "google_books_id": "HcUsDQAAQBAJ",
    "isbn": "9780143128632",
    "published_date": "2016-11-01",
    "description": "The acclaimed Pelican Shakespeare series, now in a dazzling new series design Winner of the 2016 AIGA + Design Observer 50 Books | 50 Covers competition Gold Medal Winner of the 3x3 Illustration Annual No. 14 This edition of The Tempest is edited with an introduction and notes by Peter Holland and was recently repackaged with cover art by Manuja Waldia. Waldia received a Gold Medal from the Society of Illustrators for the Pelican Shakespeare series. The legendary Pelican Shakespeare series features authoritative and meticulously researched texts paired with scholarship by renowned Shakespeareans. Each book includes an essay on the theatrical world of Shakespeare’s time, an introduction to the individual play, and a detailed note on the text used. Updated by general editors Stephen Orgel and A. R. Braunmuller, these easy-to-read editions incorporate over thirty years of Shakespeare scholarship undertaken since the original series, edited by Alfred Harbage, appeared between 1956 and 1967. With stunning new covers, definitive texts, and illuminating essays, the Pelican Shakespeare will remain a valued resource for students, teachers, and theater professionals for many years to come. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "page_count": 130
  }
]